package mission.yoosik.Q15;

// ALOHA 스터디는 모든 수강생에게 다양한 교재를 제공하기 위해 작은 도서관을 운영하려고 한다. 
// 이 도서관의 교재를 관리하기 위한 프로그램을 아래의 조건에 따라 구현하시오.
// - 구현할기능
// 1. isbn, title, writer, content, price 를 멤버변수로 갖는 Book 클래스 정의
// 2. Book 클래스의 생성자를 정의하되, 최소1번 이상 오버로딩 하시오.
// 3. Book 클래스의 멤버 변수의 값을 가져오고, 지정하는 getter, setter 메소드 정의
// 4. Book 클래스의 멤버 변수들을 정리된 문자열 형태로 반환해주는 toString 메소드정의
// 5. Book 객체를 생성할 Library 클래스 정의. 아래의 출력 결과와 같이 실행되도록 main 메소드를 작성하시오.
// <조건> 
// - 객체는 별도로 입력받지 않고, 출력 결과와 동일한 정보를 갖도록 생성한다.
// - 생성된 Book 객체들은 컬렉션에 추가하고 반복문을 이용하여 출력한다.
//
// ==================== ALOHA 스터디도서관====================
// 123123	| 이게자바냐	| 감자바	| 자바감자바	| 33000
// 112112	| 정보처리기사	| 김휴먼	| 국가기술자격	| 45000
// 001001	| 실무DB		| 박디비	| 디비디비딥	| 60000

public class Main_Q15 {
	public static void main(String[] args) {

	}
}
